HW10/shop/app/views/layouts/template/_sidebar.html.erb

    <% if current_user %>
      <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"